{
	"BookDetailsArray":
	[

	{
	"BookID":1,
	"BookName":"The Kind Worth Killing",
        "BookAuthor":"By Peter Swanson",
        "BookPicture":"https://github.com/rnair8/JSONProjectsIT315/blob/master/kindworth.png?raw=true",
        "BookDescription":"A devious tale of psychological suspense so irresistible that it prompts Entertainment Weekly to ask, Is The Kind Worth Killing the next Gone Girl? From one of the hottest thriller writers, Peter Swanson, this is his breakout novel and is soon to be a major movie directed by Agnieszka Holland. On a night flight from London to Boston, Ted Severson meets the stunning and mysterious Lily Kintner. Sharing one too many martinis, the strangers begin to play a game of truth, revealing very intimate details about themselves. Ted talks about his marriage that is going stale and his wife Miranda, who he is sure is cheating on him. Their game turns a little darker when Ted jokes that he could kill Miranda for what she has done. Lily, without missing a beat, says calmly, I would like to help. After all, some people are the kind worth killing, like a lying, stinking, cheating spouse. . . . A chilling game of cat and mouse, one they both cannot survive . . .",
        "BookGenre":"Suspense",
        "BookPrice":"$18.46",
        "BookRating":"4.03/5",
        "BookPurchase":"https://www.amazon.com/Kind-Worth-Killing-Novel/dp/0062267523/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=1585209480&sr=8-2",
        "BookReview":"https://www.goodreads.com/book/show/21936809-the-kind-worth-killing?ac=1&from_search=true&qid=9Du66Wigwy&rank=1#other_reviews"
	},

	{
	"BookID":2,
	"BookName":"The Wife Between Us",
        "BookAuthor":"By Sarah Pekkanen & Greer Hendricks",
        "BookPicture":"https://github.com/rnair8/JSONProjectsIT315/blob/master/wife.png?raw=true",
        "BookDescription":"When you read this book, you will make many assumptions. You will assume you are reading about a jealous ex-wife. You will assume she is obsessed with her replacement – a beautiful, younger woman who is about to marry the man they both love. You will assume you know the anatomy of this tangled love triangle. Assume nothing. Twisted and deliciously chilling, Greer Hendricks and Sarah Pekkanen's The Wife Between Us exposes the secret complexities of an enviable marriage - and the dangerous truths we ignore in the name of love. Read between the lies.",
        "BookGenre":"Mystery",
        "BookPrice":"$12.00",
        "BookRating":"3.84/5",
        "BookPurchase":"https://www.amazon.com/Wife-Between-Us-Novel/dp/1250130921/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=1585209852&sr=8-2",
        "BookReview":"https://www.goodreads.com/book/show/34189556-the-wife-between-us?ac=1&from_search=true&qid=ZPU9M1EORw&rank=1#other_reviews"
	},

	{
	"BookID":3,
	"BookName":"The Whisper Man",
        "BookAuthor":"By Alex North",
        "BookPicture":"https://github.com/rnair8/JSONProjectsIT315/blob/master/whisper.png?raw=true",
        "BookDescription":"After the sudden death of his wife, Tom Kennedy believes a fresh start will help him and his young son Jake heal. A new beginning, a new house, a new town. Featherbank. But the town has a dark past. Twenty years ago, a serial killer abducted and murdered five residents. Until Frank Carter was finally caught, he was nicknamed The Whisper Man, for he would lure his victims out by whispering at their windows at night. Just as Tom and Jake settle into their new home, a young boy vanishes. His disappearance bears an unnerving resemblance to Frank Carter's crimes, reigniting old rumors that he preyed with an accomplice. Now, detectives Amanda Beck and Pete Willis must find the boy before it is too late, even if that means Pete has to revisit his great foe in prison: The Whisper Man. And then Jake begins acting strangely. He hears a whispering at his window..",
        "BookGenre":"Horror/Thriller",
        "BookPrice":"$12.96",
        "BookRating":"4.07/5",
        "BookPurchase":"https://www.amazon.com/Whisper-Man-Alex-North/dp/1250317991/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=1585209953&sr=8-2",
        "BookReview":"https://www.goodreads.com/book/show/41940236-the-whisper-man?ac=1&from_search=true&qid=CkKnFxvTuM&rank=1#other_reviews"
	},

	{
	"BookID":4,
	"BookName":"Eight Perfect Murders",
        "BookAuthor":"By Peter Swanson",
        "BookPicture":"https://github.com/rnair8/JSONProjectsIT315/blob/master/eight.png?raw=true",
        "BookDescription":"Years ago, bookseller and mystery aficionado Malcolm Kershaw compiled a list of the genre’s most unsolvable murders, those that are almost impossible to crack—which he titled “Eight Perfect Murders”—chosen from among the best of the best including Agatha Christie’s A. B. C. Murders, Patricia Highsmith’s Strangers on a Train, Ira Levin’s Death Trap, A. A. Milne's Red House Mystery, Anthony Berkeley Cox's Malice Aforethought, James M. Cain's Double Indemnity, John D. Macdonald's The Drowner, and Donna Tartt's A Secret History. But no one is more surprised than Mal, now the owner of the Old Devils Bookstore in Boston, when an FBI agent comes knocking on his door one snowy day in February. She’s looking for information about a series of unsolved murders that look eerily similar to the killings on Mal’s old list. ",
        "BookGenre":"Thriller",
        "BookPrice":"$22.39",
        "BookRating":"3.73/5",
        "BookPurchase":"https://www.amazon.com/Eight-Perfect-Murders-Peter-Swanson/dp/0062838202/ref=tmm_hrd_swatch_0?_encoding=UTF8&qid=1585209990&sr=8-2",
        "BookReview":"https://www.goodreads.com/book/show/52225186-eight-perfect-murders?ac=1&from_search=true&qid=qkTF1BjrHU&rank=1#other_reviews"
	},
	
	{
	"BookID":5,
	"BookName":"Normal People",
        "BookAuthor":"By Sally Rooney",
        "BookPicture":"https://github.com/rnair8/JSONProjectsIT315/blob/master/normal.jpg?raw=true",
        "BookDescription":"Connell and Marianne grew up in the same small town, but the similarities end there. At school, Connell is popular and well liked, while Marianne is a loner. But when the two strike up a conversation—awkward but electrifying—something life changing begins.A year later, they’re both studying at Trinity College in Dublin. Marianne has found her feet in a new social world while Connell hangs at the sidelines, shy and uncertain. Throughout their years at university, Marianne and Connell circle one another, straying toward other people and possibilities but always magnetically, irresistibly drawn back together. And as she veers into self-destruction and he begins to search for meaning elsewhere, each must confront how far they are willing to go to save the other. Normal People is the story of mutual fascination, friendship and love. It takes us from that first conversation to the years beyond, in the company of two people who try to stay apart but find that they can’t.",
        "BookGenre":"Contemporary Fiction",
        "BookPrice":"$17.31",
        "BookRating":"3.86/5",
        "BookPurchase":"https://www.amazon.com/Normal-People-Novel-Sally-Rooney/dp/1984822179",
        "BookReview":"https://www.goodreads.com/book/show/41057294-normal-people"

	},
	{
	"BookID":6,
	"BookName":"Into the Darkest Corner",
        "BookAuthor":"Elizabeth Haynes",
        "BookPicture":"https://github.com/rnair8/JSONProjectsIT315/blob/master/darkest.jpg?raw=true",
        "BookDescription":"Catherine has been enjoying the single life long enough to know a catch when she sees one. Gorgeous, charismatic and spontaneous, Lee seems almost too perfect to be true. And her friends clearly agree, as each in turn falls under his spell. But what begins as flattering attentiveness turns into raging jealousy, and Catherine soon learns there is a darker side to Lee. His increasingly erratic, controlling behaviour becomes frightening, but no one believes her when she shares her fears. Increasingly isolated and driven into the darkest corner of her world, a desperate Catherine plans a meticulous escape. Four years later, Lee is behind bars and Catherine—now Cathy—compulsively checks the locks and doors in her apartment, trusting no one. But when an attractive upstairs neighbour, Stuart, comes into her life, Cathy dares to hope that happiness and love may still be possible, until she receives a phone call informing her of Lee’s impending release.",
        "BookGenre":"Thriller",
        "BookPrice":"$13.97",
        "BookRating":"4.09/5",
        "BookPurchase":"https://www.amazon.com/Into-Darkest-Corner-Elizabeth-Haynes-ebook/dp/B007HC3LHS/ref=sr_1_1?crid=2MZAUC191G35Z&dchild=1&keywords=into+the+darkest+corner+by+elizabeth+haynes&qid=1588521088&s=books&sprefix=into+the+darkest+c%2Cstripbooks%2C130&sr=1-1",
        "BookReview":"https://www.goodreads.com/book/show/15818362-into-the-darkest-corner"

	},
	{
	"BookID":7,
	"BookName":"City of Girls",
        "BookAuthor":"Elizabeth Gilbert",
        "BookPicture":"https://github.com/rnair8/JSONProjectsIT315/blob/master/girls.jpg?raw=true",
        "BookDescription":"Told from the perspective of an older woman as she looks back on her youth with both pleasure and regret. In 1940, nineteen-year-old Vivian Morris has just been kicked out of Vassar College, owing to her lackluster freshman-year performance. Her affluent parents send her to Manhattan to live with her Aunt Peg, who owns a flamboyant, crumbling midtown theater called the Lily Playhouse. There Vivian is introduced to an entire cosmos of unconventional and charismatic characters, from the fun-chasing showgirls to a sexy male actor, a grand-dame actress, a lady-killer writer, and no-nonsense stage manager. But when Vivian makes a personal mistake that results in professional scandal, it turns her new world upside down in ways that it will take her years to fully understand. Ultimately, though, it leads her to a new understanding of the kind of life she craves - and the kind of freedom it takes to pursue it.",
        "BookGenre":"Historical Fiction",
        "BookPrice":"$14.69",
        "BookRating":"4.05/5",
        "BookPurchase":"https://www.amazon.com/City-Girls-Novel-Elizabeth-Gilbert-ebook/dp/B07HZ2Q1MK/ref=sr_1_1?crid=2T5U8GJP0M0NL&dchild=1&keywords=city+of+girls+elizabeth+gilbert&qid=1588521691&s=books&sprefix=city+of+go%2Cstripbooks%2C131&sr=1-1",
        "BookReview":"https://www.goodreads.com/book/show/42135029-city-of-girls?ac=1&from_search=true&qid=w8GpVXG8vB&rank=1"

	}

	],
	"Status":"OK"
}
